backend/app/Modules/Sites/Models/Site.php

    public function setConfig($keyName, $keyValue, string $comments): Model|Builder
    {
        return SiteConfig::query()->updateOrCreate(
            ['key_name' => $keyName,'site_id' => $this->id],
            ['key_value'=> $keyValue, 'comments' => $comments]
        );
---
select * from "site_configs" where "site_id" = 1