backend/app/Modules/Sites/Models/SiteBlacklistedIp.php

select count(*) as aggregate from "site_blacklisted_ips" where "ip" = '172.21.0.1'
---
    public static function isBlackListed(string $ip)
    {
        return self::query()
                ->where('ip', $ip)
                ->count() > 0;