backend/app/Modules/Projects/Models/Project.php

    public static function getGlobalProjects(): Collection|array
    {
        return self::query()->where('is_personal', 0)
            ->orderBy('id', 'desc')
            ->get();
---
select * from "projects" where "is_personal" = 0 order by "id" desc