backend/app/Modules/Users/Http/Controllers/UserPortfolioController.php

    public function uploadAvatar(Request $request): RedirectResponse
    {
        try {
            $this->validate($request, ['avatar' => 'required|image|max:' . 1024 * 5 /* 5 MB */]);
        }catch (Exception $exception) {
            Session::flash('error_message', $exception->getMessage());
            throw  $exception;
        }

        $s3File = AmazonS3Service::newInstance()->upload(
            'users::avatar_url',
            $request->file('avatar'),
            'users/avatars',
            ['model' => User::class],
        );

        /** @var User $user */
        $user = Auth::user();
        $user->update(['avatar_url' => $s3File->s3_url]);
---
update "users" set "avatar_url" = 'https://s3.us-east-1.amazonaws.com/trenchdevs-assets/local/users/avatars/02612cf2caa6e5c1ead160e6f7e46103', "updated_at" = '2022-08-06 13:14:14' where "id" = 1