backend/app/Modules/Users/Services/UserJsonAttributeService.php

select * from "user_json_attribute_keys" where "user_json_attribute_keys"."key" = 'system::portfolio::experiences' limit 1
---
    private function __construct(string $key)
    {
        /** @var UserJsonAttributeKey $model */
        $model = UserJsonAttributeKey::query()->findOrFail($key);

select * from "user_json_attributes" where ("user_id" = 1 and "key" = 'system::portfolio::experiences') limit 1
---
    public function upsert(int $userId, array $value): Model
    {
        // system::portfolio::experiences
        return UserJsonAttribute::query()->updateOrCreate(
            ['user_id' => $userId, 'key' => $this->userJsonAttributeKey->key],
            ['value' => $value]
        );