backend/app/Modules/Aws/Services/AmazonS3Service.php

insert into "aws_s3_uploads" ("s3_url", "s3_path", "status", "identifier", "meta", "updated_at", "created_at") values ('https://s3.us-east-1.amazonaws.com/trenchdevs-assets/local/users/avatars/02612cf2caa6e5c1ead160e6f7e46103', 'local/users/avatars/02612cf2caa6e5c1ead160e6f7e46103', 'uploaded', 'users::avatar_url', '{"original_name":"Screenshot from 2022-07-27 15-31-28.png","environment":"local","size":1237,"model":"App\Modules\Users\Models\User"}', '2022-08-06 13:14:14', '2022-08-06 13:14:14') returning "id"
---
    public function upload(string $identifier, UploadedFile $file, string $s3filePath, array $meta = []): ?AwsS3Upload
    {
        $appEnv = app()->environment();

        if (!$appEnv) {
            throw new ErrorException("APP_ENV not set");
        }

        $originalName = $file->getClientOriginalName();
        $hash         = md5(time() . $originalName . rand(0, PHP_INT_MAX));

        $filePath = "{$appEnv}/$s3filePath/$hash";
        $filePath = $this->normalizeUrl($filePath);

        $uploadedFile = null;

        if (Storage::disk('s3')->put($filePath, file_get_contents($file))) {
            $s3FullPath = add_scheme_to_url($this->normalizeUrl($this->generateS3BaseUrl() . $filePath), true);
            /** @var AwsS3Upload $uploadedFile */
            $uploadedFile = AwsS3Upload::query()->create([
                's3_url'     => $s3FullPath,
                's3_path'    => $filePath,
                'status'     => AwsS3Upload::DB_STATUS_UPLOADED,
                'identifier' => $identifier,
                'meta'       => json_encode(array_merge([
                    'original_name' => $originalName,
                    'environment'   => $appEnv,
                    'size' => $file->getSize(),
                ], $meta)),
            ]);