backend/app/Modules/Users/Models/UserJsonAttribute.php

    public static function getValueFromKey(int $id, string $key, $default = []): array {
        return UserJsonAttribute::query()
            ->join('user_json_attribute_keys', 'user_json_attribute_keys.key', '=', 'user_json_attributes.key')
            ->where('user_json_attributes.user_id', '=', $id)
            ->where('user_json_attributes.key', '=', $key)
            ->first()
            ->value ?? $default;
---
select * from "user_json_attributes" inner join "user_json_attribute_keys" on "user_json_attribute_keys"."key" = "user_json_attributes"."key" where "user_json_attributes"."user_id" = 1 and "user_json_attributes"."key" = 'system::portfolio::experiences' limit 1